import 'package:azkary_app/core/utils/app_colors.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class AdhdhkarAlmasa extends StatefulWidget {
  @override
  _AzkarAlsabahScreenState createState() => _AzkarAlsabahScreenState();
}

class _AzkarAlsabahScreenState extends State<AdhdhkarAlmasa> {
  // قائمة الأذكار مع عدد مرات التكرار المطلوبة
  final List<Map<String, dynamic>> azkarAlsabah = [
    {
      'text': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.',
      'repeat': 1,
    },
    {
      'text': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
      'repeat': 3,
    },
    {
      'text': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      'repeat': 3,
    },
    {
      'text': ' بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ',
      'repeat': 3,
    },
    {
      'text': ' أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربّ أعوذ بك من الكسل وسوء الكبر، ربّ أعوذ بك من عذاب في النار وعذاب في القبر. ',
      'repeat': 1,
    },
    {
      'text': ' اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذ بك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .  ',
      'repeat': 1,
    },
    {
      'text': ' رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا.  ',
      'repeat': 3,
    },
    {
      'text': ' اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.  ',
      'repeat': 4,
    },
    {
      'text': ' اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر  ',
      'repeat': 1,
    },
    {
      'text': ' حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.  ',
      'repeat': 7,
    },
    {
      'text': '  بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم. ',
      'repeat': 3,
    },
    {
      'text': '  اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور ',
      'repeat': 1,
    },
    {
      'text': '  أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين. ',
      'repeat': 1,
    },
    {
      'text': '  سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه. ',
      'repeat': 3,
    },
    {
      'text': '  اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت ',
      'repeat': 3,
    },
    {
      'text': ' اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت  ',
      'repeat': 3,
    },
    {
      'text': ' اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.  ',
      'repeat': 1,
    },
    {
      'text': ' يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين.  ',
      'repeat': 3,
    },
    {
      'text': ' أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده.  ',
      'repeat': 1,
    },
    {
      'text': '  اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم. ',
      'repeat': 1,
    },
    {
      'text': ' أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق ',
      'repeat': 3,
    },
    {
      'text': ' اللهم صل وسلم وبارك على نبينا محمد. ',
      'repeat': 10,
    },
    {
      'text': ' اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه ',
      'repeat': 3,
    },
    {
      'text': ' اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال',
      'repeat': 3,
    },
    {
      'text': 'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه. ',
      'repeat': 3,
    },
    {
      'text': 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك ',
      'repeat': 3,
    },
    {
      'text': ' اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا.',
      'repeat': 1,
    },
    {
      'text': 'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم. ',
      'repeat': 1,
    },
    {
      'text': 'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. ',
      'repeat': 100,
    },
    {
      'text': 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ',
      'repeat': 100,
    },

    // أضف المزيد من الأذكار هنا
  ];

  // قائمة لتتبع عدد المرات التي تم فيها تكرار كل ذكر
  late List<int> counters;

  @override
  void initState() {
    super.initState();
    // تهيئة قائمة العدادات بصفر
    counters = List<int>.filled(azkarAlsabah.length, 0);
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('أذكار الصباح'),
      ),
      body: ListView.builder(
        itemCount: azkarAlsabah.length,
        itemBuilder: (context, index) {
          return Card(
            color: AppColors.black,
            margin: EdgeInsets.all(10),
            child: Padding(
              padding: EdgeInsets.all(15),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.center,
                children: [
                  Text( textAlign: TextAlign.center,
                    azkarAlsabah[index]['text'],
                    style: TextStyle(fontSize: 25.sp,color: AppColors.offWhite),
                  ),
                  SizedBox(height: 10),
                  Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: [
                      Text(
                        ' العدد: ${azkarAlsabah[index]['repeat']},',
                        style: TextStyle(fontSize: 25.sp,color: AppColors.lightGrey),
                      ),
                      Row(
                        children: [
                          IconButton(
                            icon: Icon(Icons.remove),
                            onPressed: () {
                              setState(() {
                                if (counters[index] > 0) counters[index]--;
                              });
                            },
                          ),
                          Text(
                            '${counters[index]}',
                            style: TextStyle(fontSize: 25.sp,color: AppColors.offWhite),
                          ),
                          IconButton(
                            color: AppColors.red,
                            icon: Icon(Icons.add,size: 35.sp,),
                            onPressed: () {
                              setState(() {
                                if (counters[index] <
                                    azkarAlsabah[index]['repeat'])
                                  counters[index]++;
                              });
                            },
                          ),
                        ],
                      ),
                    ],
                  ),
                ],
              ),
            ),
          );
        },
      ),
    );
  }
}
